# Bot command messages
WELCOME = "Вас приветсвует бот канала @Unilecs! 🖥 Чем я могу вам помочь?🔖"
HELP = "У меня есть несколько функций! \nНачнем по порядку :\n- *Список задач:* я отправлю Вам ссылку на пост с " \
       "задачами нашего канала.\n- *Поиск:* я нахожу задачи по названию или номеру и отправляю Вам ссылки на посты с " \
       "ними.\n- *Книги:* я отправляю вам ссылки на посты с подборками книг от нашего канала.\n- *Получить задачу по " \
       "сложности:* вы выбираете сложность задачи я отправляю вам ссылку на случайную задачу данной сложности.\n- " \
       "*Отправить решение:* в следуйщем сообщении вы отправляете свое решение последней опубликованной  задачи на " \
       "нашем канале (@UniLecs).\n- *Отправить отзыв:* в следующем сообщеении вы отправляете свой отзыв по поводу " \
       "моей работы, публикации задач на канале @UniLecs и т.д.\n\n**P.S.** Конечно же, лучше всего ознакомиться с " \
       "функциями можно, опробовав их все\uD83D\uDE1C "
ABOUT = "Я - бот канала @UniLecs. Предоставляю автоматизированный способ получения задач и не \nтолько. Есть вопрос? " \
        "Вам сюда -> @albert_davletov "

# Common messages
UNKNOWN_COMMAND_RESPONSE = "Простите, я вас не понимаю. Попробуйте еще раз."
CHOOSE_CATEGORY = "Выберите категорию."
CATEGORY_NOT_FOUND = "Такой категории нет. Попробуйте еще раз."
CHOOSE_NEXT_ACTION = "Выберите следующее действие."
CANCEL_SEARCH = "Поиск отменен. Выберите следующее действие."

# TASKS
ENTER_TASK_NUMBER = "Введите название задачи или ее номер."
TASK_NUMBER_NOT_FOUND = "Задачи с таким номером не найдено. Попробуйте еще раз."
TASK_NOT_FOUND = "Ни одной задачи не найдено. Попробуйте еще раз."
TOO_MANY_TASKS_FOUND = "Найдено слишком много задач. Попробуйте ввести более корректный запрос."

# SEND Messages
CHOOSE_WHAT_TO_SEND = "Что вы хотите отправить?!"
SEND_FEEDBACK = 'В следующем сообщении введите свой отзыв. Чтобы отменить написание отзыва, введите "Отмена".'
SEND_SOLUTION = '💡 В следующем сообщении введите свое решение последней опубликованной задачи. Чтобы отменить отправку решения, введите "Отмена".'

CANCEL_SEND_MESSAGE = "Вы отменили отправку сообщения. Выберите следующее действие."
CANCEL_SEND_FEEDBACK = "Вы отменили написание отзыва. Выберите дальнейшее действие."
CANCEL_SEND_SOLUTION = "Вы отменили отправку решения. Выберите дальнейшее действие."

THANKS_FOR_FEEDBACK = "Спасибо за ваш отзыв. Выберите следующее действие."
THANKS_FOR_SOLUTION = "Спасибо за ваше решение. Выберите следующее действие."
