# Bot command messages
WELCOME = "Вас приветсвует бот канала @Unilecs! 🖥 Чем я могу вам помочь?🔖"
HELP = "У меня есть несколько функций!" \
       "\n- *Задачи:* раздел с > 300 задачами по программированию с подробным разбором. Все бесплатно, пользуйтесь!" \
       "\n- *Головоломки*: задачи слишком сложные?! Расслабьтесь с нашими головоломками, вспомните школьные годы." \
       "\n- *Книги:* лучшие подборки книг от нашего канала." \
       "\n- *Тесты:* здесь вы можете найти онлайн-тесты по программированию." \
       "\n- *Поиск:* найду задачу по названию или номеру, пишите." \
       "\n- *Отправить:* оставьте свой вариант решения, или просто напишите нам ваши предложения, вопросы." \
       "\n\n*P.S.* Конечно же, лучше всего ознакомиться с функциями можно, опробовав их все!"
ABOUT = "Я - бот канала @UniLecs. Предоставляю автоматизированный способ получения контента для программистов."

# Common messages
UNKNOWN_COMMAND_RESPONSE = "Простите, я вас не понимаю. Попробуйте еще раз."
CHOOSE_CATEGORY = "Выберите категорию."
CATEGORY_NOT_FOUND = "Такой категории нет. Попробуйте еще раз."
CHOOSE_NEXT_ACTION = "Выберите следующее действие."
CANCEL_SEARCH = "Поиск отменен. Выберите следующее действие."

# TASKS
ENTER_TASK_NUMBER = "Введите название задачи или ее номер."
TASK_NUMBER_NOT_FOUND = "Задачи с таким номером не найдено. Попробуйте еще раз."
TASK_NOT_FOUND = "Ни одной задачи не найдено. Попробуйте еще раз."
TOO_MANY_TASKS_FOUND = "Найдено слишком много задач. Попробуйте ввести более корректный запрос."
CANCEL_TASKS = "Вы отменили поиск по задачам. Выберите следующее действие."

# PUZZLES
CANCEL_PUZZLES = "Вы отменили поиск по головоломкам. Выберите следующее действие."

# TESTS
CANCEL_TESTS = "Вы отменили поиск по тестам. Выберите следующее действие."

# SEND Messages
CHOOSE_WHAT_TO_SEND = "Что вы хотите отправить?!"
SEND_FEEDBACK = 'В следующем сообщении введите свой отзыв. Чтобы отменить написание отзыва, введите "Отмена".'
SEND_SOLUTION = '💡 В следующем сообщении введите свое решение последней опубликованной задачи. Чтобы отменить отправку решения, введите "Отмена".'

CANCEL_SEND_MESSAGE = "Вы отменили отправку сообщения. Выберите следующее действие."
CANCEL_SEND_FEEDBACK = "Вы отменили написание отзыва. Выберите дальнейшее действие."
CANCEL_SEND_SOLUTION = "Вы отменили отправку решения. Выберите дальнейшее действие."

THANKS_FOR_FEEDBACK = "Спасибо за ваш отзыв. Выберите следующее действие."
THANKS_FOR_SOLUTION = "Спасибо за ваше решение. Выберите следующее действие."

# FORMAT Strings
RANDOM_TASK = "*🎲 Задача на удачу:*\n\n[№ {0}: {1}]({2})"
RANDOM_PUZZLE = "*🎲 Головоломка на удачу:*\n\n[№ {0}: {1}]({2})"
