TOKEN = "1192799493:AAHgw2987L8bKrXklcgP3OKScvTRLGBVhpQ"  # bot token

# create a repository and place a db.json file in the root folder
BASE_URL = "https://my-json-server.typicode.com/Muhammadrasul446/test"

# messages
WELCOME = "Вас приветсвует бот канала @Unilecs! 🖥 Чем я могу вам помочь?🔖"
HELP = "У меня есть несколько функций! \nНачнем по порядку :\n- *Список задач:* я отправлю Вам ссылку на пост с " \
       "задачами нашего канала.\n- *Поиск:* я нахожу задачи по названию или номеру и отправляю Вам ссылки на посты с " \
       "ними.\n- *Книги:* я отправляю вам ссылки на посты с подборками книг от нашего канала.\n- *Получить задачу по " \
       "сложности:* вы выбираете сложность задачи я отправляю вам ссылку на случайную задачу данной сложности.\n- " \
       "*Отправить решение:* в следуйщем сообщении вы отправляете свое решение последней опубликованной  задачи на " \
       "нашем канале (@UniLecs).\n- *Отправить отзыв:* в следующем сообщеении вы отправляете свой отзыв по поводу " \
       "моей работы, публикации задач на канале @UniLecs и т.д.\n\n**P.S.** Конечно же, лучше всего ознакомиться с " \
       "функциями можно, опробовав их все\uD83D\uDE1C "
ABOUT = "Я - бот канала @UniLecs. Предоставляю автоматизированный способ получения задач и не \nтолько. Есть вопрос? " \
        "Вам сюда -> @albert_davletov "
